app/models/sale.rb

        end
      end

      # Verifica se já existe uma comissão, caso sim atualiza, caso não cria uma nova.
      if self.comission.present?
        self.comission.update(value: (calc * 0.1), status: :pending)
      else
        Comission.create(value: (calc * 0.1), user: self.user, sale: self, status: :pending)
---
SELECT  "comissions".* FROM "comissions" WHERE "comissions"."sale_id" = ? LIMIT ?  [["sale_id", 1], ["LIMIT", 1]]
INSERT INTO "comissions" ("sale_id", "value", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sale_id", 1], ["value", 7.0], ["user_id", 1], ["status", 0], ["created_at", "2019-06-05 01:47:11.137251"], ["updated_at", "2019-06-05 01:47:11.137251"]]